docs/cfd/case/single-room/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Lowest-effort settings that still produce a usable mesh: no surface
// refinement beyond level 0, no explicit feature-edge snapping, no boundary
// layers. Good enough to prove the modeler's exported STL actually meshes;
// not tuned for solution accuracy.

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    "single-room.stl"
    {
        type    triSurfaceMesh;
        name    singleRoom;
        regions
        {
            walls   { name walls; }
            floor   { name floor; }
            ceiling { name ceiling; }
        }
    }
}

castellatedMeshControls
{
    maxLocalCells       100000;
    maxGlobalCells      500000;
    minRefinementCells  0;
    nCellsBetweenLevels 1;

    features ();

    refinementSurfaces
    {
        singleRoom
        {
            level (0 0);
            regions
            {
                walls   { level (0 0); patchInfo { type wall; } }
                floor   { level (0 0); patchInfo { type wall; } }
                ceiling { level (0 0); patchInfo { type wall; } }
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions {}

    // Inside the room, well clear of the walls (room interior spans roughly
    // x:[0.075,3.925] y:[0.075,2.925] z:[0,2.5] - see docs/cfd-validation.md).
    locationInMesh (2 1.5 1.25);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      30;
    nRelaxIter      5;

    nFeatureSnapIter    0;
    implicitFeatureSnap false;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers {}
    expansionRatio          1.0;
    finalLayerThickness     0.3;
    minThickness            0.1;
    nGrow                   0;
    featureAngle            30;
    nRelaxIter              5;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
    nRelaxedIter            20;
}

meshQualityControls
{
    #includeEtc "caseDicts/meshQualityDict"

    relaxed
    {
        maxNonOrtho 75;
    }

    nSmoothScale   4;
    errorReduction 0.75;
}

writeFlags
(
);

mergeTolerance 1E-6;

// ************************************************************************* //
