docs/cfd/case/single-room/0/U
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type    noSlip;
    }

    floor
    {
        type    noSlip;
    }

    ceiling
    {
        type    noSlip;
    }
}

// ************************************************************************* //
