docs/cfd/case/single-room/0/p
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    walls
    {
        type    calculated;
        value   $internalField;
    }

    floor
    {
        type    calculated;
        value   $internalField;
    }

    ceiling
    {
        type    calculated;
        value   $internalField;
    }
}

// ************************************************************************* //
