docs/cfd/case/single-room/0/T
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }

    floor
    {
        type            fixedValue;
        value           uniform 307.75; // 34.6 degC, drives an unstable (hot-below) convection cell
    }

    ceiling
    {
        type            fixedValue;
        value           uniform 288.15; // 15 degC
    }
}

// ************************************************************************* //
