docs/cfd/case/single-room/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type    compressible::alphatWallFunction;
        Prt     0.85;
        value   uniform 0;
    }

    floor
    {
        type    compressible::alphatWallFunction;
        Prt     0.85;
        value   uniform 0;
    }

    ceiling
    {
        type    compressible::alphatWallFunction;
        Prt     0.85;
        value   uniform 0;
    }
}

// ************************************************************************* //
