docs/cfd/case/single-room/0/k
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-04;

boundaryField
{
    walls
    {
        type    kqRWallFunction;
        value   uniform 3.75e-04;
    }

    floor
    {
        type    kqRWallFunction;
        value   uniform 3.75e-04;
    }

    ceiling
    {
        type    kqRWallFunction;
        value   uniform 3.75e-04;
    }
}

// ************************************************************************* //
