docs/cfd/case/single-room/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type    nutUWallFunction;
        value   uniform 0;
    }

    floor
    {
        type    nutUWallFunction;
        value   uniform 0;
    }

    ceiling
    {
        type    nutUWallFunction;
        value   uniform 0;
    }
}

// ************************************************************************* //
