docs/cfd/case/single-room/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.12;

boundaryField
{
    walls
    {
        type    omegaWallFunction;
        value   uniform 0.12;
    }

    floor
    {
        type    omegaWallFunction;
        value   uniform 0.12;
    }

    ceiling
    {
        type    omegaWallFunction;
        value   uniform 0.12;
    }
}

// ************************************************************************* //
