docs/cfd/case/single-room/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver      GAMG;
        tolerance   1e-7;
        relTol      0.01;
        smoother    DICGaussSeidel;
    }

    "(U|h|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }
}

SIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    pRefCell    0;
    pRefValue   0;

    residualControl
    {
        p_rgh   1e-4;
        U       1e-4;
        h       1e-4;
        "(k|omega)" 1e-3;
    }
}

relaxationFactors
{
    fields
    {
        rho     1.0;
        p_rgh   0.7;
    }
    equations
    {
        U           0.3;
        h           0.3;
        "(k|omega)" 0.7;
    }
}

// ************************************************************************* //
